import json

from channel_automation.assistant.models import PostData

json_text = """{"social_post": "🎨 Третья Биеннале Таиланда запланирована на период с 9 декабря 2023 года по 30 апреля 2024 года в Чианг Рае. Биеннале Чианг Рай 2023 подчеркнет произведения искусства 60 художников из 21 страны под темой «Открытый мир». Основные места проведения включают Международный художественный музей Чианг Рай, храм Ват Ронг Кхун, музей Баан Дам и другие замечательные места.

🏛 Будет представлено более 10 павильонов от местных и международных кураторов и художников, включая Корейский павильон, павильон МоМА Варшава и другие.

🎭 В течение пяти месяцев будут проходить сопутствующие мероприятия в сотрудничестве с местными сообществами, включая музыкальные выступления многонациональных групп, показы фильмов, семинары и открытые дни более 30 художественных студий в Чианг Рае.

🔗 Для получения дополнительной информации посетите веб-сайт мероприятия www.thailandbiennale.org или следите за его страницей в Facebook: Thailand Biennale.", "images_search": "Thailand Biennale Chiang Rai 2023"}"""

post_data = None
try:
    json_data = json.loads(json_text)
    post_data = PostData(**json_data)
except Exception as e:
    print(e)

print(post_data.social_post)
